export const REGEX_REGULAR = {
  VALIDATE_PHONE: /(03|3|05|5|07|7|08|8|09|9|01|1[2|6|8|9])+([0-9]{8})\b/,
  VALIDATE_NAME: /^[A-Z]+(([',. -][A-Z ])?[A-Z]*)*$/,
  VALIDATE_FULLNAME: /^[a-zA-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂẾưăạảấầẩẫậắằẳẵặẹẻẽềềểếỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ| ]+$/,
  REGEX_VIETNAMESE: /[^ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂưăạảấầẩẫậắằẳẵặẹẻẽềềểỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ]/u,
  VALIDATE_ANPHANUMERIC: /^[0-9a-zA-Z]+$/,
  VALIDATE_SPECIAL: /[^a-zA-Z0-9| ]/g,
  VALIDATE_ADDRESS: /^[a-zA-Z0-9ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂẾưăạảấầẩẫậắằẳẵặẹẻẽềềểếỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ| |//|()|.|-|,|;]+$/,
  VALIDATE_NUMBER: /[^0-9|]/g,
  VALIDATE_FULLNAME_INPUT: /[^a-zA-Z| ]/g,
  VALIDATE_EMAIL: /^(([^<>()[\]\\.,;:\s@\\"]+(\.[^<>()[\]\\.,;:\s@\\"]+)*)|(\\".+\\"))@(([^<>()[\]\\.,;:\s@\\"]+\.)+[^<>()[\]\\.,;:\s@\\"]{2,})$/i,
  VALIDATE_NUMERIC: /^(\d+\.?\d{0,9}|\.\d{1,9})$/,
}